---
kind: property
id: P:Autodesk.Revit.DB.IViewSheetSet.IsAutomatic
source: html/0d6e1c51-111d-87d6-fdb1-b24ddc09ef53.htm
---
# Autodesk.Revit.DB.IViewSheetSet.IsAutomatic Property

Automatic order or manual order.

## Syntax (C#)
```csharp
bool IsAutomatic { get; set; }
```